import React, { useRef, useEffect } from "react";
import styles from "./MobileMainPage.module.scss";
import { bookData, books } from "../../../bookData";
import { Loader } from "../../../components/Loader/Loader";
import { useState } from "react";
import { useBookPlayer } from "../../../hooks/useBookPlayer";
import { clamp, getTimeLeft } from "../../../utils/book";

const swipeMargin = 50;

export const MobileMainPage = () => {
  const [book, setBook] = useState("qaosidan-kosmosamde");
  const sectionRef = useRef(null);
  const prefaceRef = useRef(null);
  const playerRef = useRef(null);
  const soundButtonsRef = useRef(null);
  const [prevTouchX, setPrevTouchX] = useState(null);

  const {
    width,
    initialWidth,
    duration,
    currentTime,
    seekTime,
    isSeeking,
    isPaused,
    handleDrag,
    handleDragStart,
    handleDragStop,
    handlePlayToggle,
    handleNextClick,
    handlePrevClick,
  } = useBookPlayer(book, bookData, books, 32);

  function scrollToSection() {
    sectionRef.current.scrollIntoView({ behavior: "smooth" });
  }
  function scrollToPreface() {
    prefaceRef.current.scrollIntoView({ behavior: "smooth" });
  }
  function scrollToPlayer() {
    playerRef.current.scrollIntoView({ behavior: "smooth" });
  }

  const handleTouchStart = (e) => {
    setPrevTouchX(e.touches[0].clientX);
  };

  const handleTouchEnd = (e) => {
    if (e.changedTouches[0].clientX - prevTouchX > swipeMargin) {
      handleSwipeRight();
    } else if (e.changedTouches[0].clientX - prevTouchX < swipeMargin * -1) {
      handleSwipeLeft();
    }
  };

  const handleSwipeLeft = () => {
    const index = books.findIndex((bookName) => {
      return bookName === book;
    });
    setBook(books[clamp(1, index - 1, books.length - 1)]);
  };

  const handleSwipeRight = () => {
    const index = books.findIndex((bookName) => {
      return bookName === book;
    });
    setBook(books[clamp(1, index + 1, books.length - 1)]);
  };

  useEffect(() => {
    if (!soundButtonsRef.current) return;

    soundButtonsRef.current.addEventListener("touchstart", handleTouchStart);
    soundButtonsRef.current.addEventListener("touchend", handleTouchEnd);

    return () => {
      soundButtonsRef.current &&
        soundButtonsRef.current.removeEventListener(
          "touchstart",
          handleTouchStart
        );
      soundButtonsRef.current &&
        soundButtonsRef.current.removeEventListener("touchend", handleTouchEnd);
    };
  }, [soundButtonsRef, prevTouchX]);

  const ChapterImages = () => {
    const chapters = Object.entries(bookData).map(
      ([book, { title }], index) => {
        const imgSrc = `/assets/svgs/responsive-svg-TOC/${index + 1}.svg`;
        return (
          <div
            onClick={() => {
              if (title === "წინასიტყვაობა") {
                scrollToPreface();
              } else {
                scrollToPlayer();
              }

              setBook(book);
            }}
            className={styles.contents}
            key={index}
          >
            <div className={styles.contentsChild}>
              <div className={styles.chapter}>
                <a>{title}</a>
              </div>
              <div className={styles.spanIconContents}>
                <img key={title} src={imgSrc} alt={`Chapter ${index + 1}`} />
              </div>
            </div>
          </div>
        );
      }
    );

    return <>{chapters}</>;
  };

  return (
    <div className={styles.mobileVersion}>
      <section className={styles.mobilePoster}>
        <div className={styles.flexBlock}>
          <div className={styles.sectionPoster}>
            <div className={styles.mobileLetters}>
              <svg
                viewBox="0 0 55.847 102.192"
                width="55.847"
                height="102.192"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  fill="#fff"
                  d="M14.69 56.23c-1.089-3.747 1.494-6.153 2.4-9.5 2.565-5.121 9.539-5 14.5-4.451 3.212.523 3.3.2 4.053-2.939 1.326-6.179 3.6-11.751 4.6-18.057-3.958 1.358-9.4 12.651-13.184 8.1-2.127-3.346-5.5-6-5.832-10.174C27.6 14.867 57.522-13.542 55.773 7.952 54.306 28.73 49.6 49.263 45.484 69.668c-2.263 18.305-10.437 35.258-31.808 32.155C-4.585 99.092-.444 75.332 2.983 62.337c1.227-3 5.278.828 7.615.55.981.123 2.026-.265 2.762.864 1.787 2.709.055 5.834-.58 8.635-1.384 4.319-.742 8.664-.133 12.977.875 6.716 10.6 2.877 12.882-1.633C29.943 75.922 38 62.938 33.5 54.255c-2.886-3.438-6.538-.525-7.385 2.976-1.9 3.182-8.4-.494-11.429-1"
                ></path>
              </svg>
              <svg
                viewBox="0 0 34.847 46.314"
                width="34.847"
                height="46.314"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  fill="#fff"
                  d="M0 22.442c4.5-1.339 8.846.4 12.992.288.357 2.806.532 5.272 1.011 7.679 1.75 6.7 9.96-.372 8.387-5.028C18.917 12.588 12.149 19.318 15.6 0c3.353.189 6.612.37 10.229.573 2.209 4.636 1.387 10.791 4.776 15.173 3.717 4.651 4.688 10.19 4.072 16-1.07 9.4-10.046 14.36-18.9 14.561C3.166 46.529-.023 32.78.005 22.437"
                ></path>
              </svg>
              <svg
                viewBox="0 0 62.764 50.756"
                width="62.764"
                height="50.756"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  fill="#fff"
                  d="M21.575 46.588c-5.519 1.306-9.861 2.493-15.177 4.168-6.852-13.4-10.632-32.557 1.476-43.993 6.659-4.641 14.885-.952 18.979 5.863C30.453 4.98 37.23.064 45.807 0c15.92 1.7 13.26 29.065 16.957 40.854a88.679 88.679 0 00-19.024 5.4c-1.694-8.8 3.084-17.989.1-26.848-.647-3.3-4.77-5.7-6.969-2.263-3.038 3.95-2.094 9.218-2.47 13.84l-10.917 1.824c-2-3.7-1.484-8.565-4.173-11.979-9.193-6.03-6.62 12.9-2.965 16.581 1.348 1.808 2.244 4.11 3.864 5.662 1.734.831 1.662 2.219 1.367 3.521"
                ></path>
              </svg>
              <svg
                viewBox="0 0 55.766 71.329"
                width="55.766"
                height="71.329"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  fill="#fff"
                  d="M0 .834L6.255 0c2.759 15.536 4.9 63.045 22.066 67.631 8.282 1.432 15.189-2.838 19.979-9.328 11.174-15.715-13.5-31.871 1.426-29.579 2.262 10.851 9.624 17.6 3.918 29.269-5.419 13.821-25.816 17.836-36.434 7.583C4.443 52.253 4.221 19.166-.001.833"
                ></path>
              </svg>
              <svg
                viewBox="0 0 42.199 55.242"
                width="42.199"
                height="55.242"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  fill="#fff"
                  d="M27.529 54.561c6.67-12.642 17.179-34.456 3.78-45.871-5.04-2.939-12.378-4.754-16.564.352-11.274 12.109-11.455 30.992-4.18 45.3-1.862 1.639-5.04.486-7.376.684C-1.68 53.286.604 40.346.148 35.784-.944 19.395 9.934-6.845 29.973 1.643c20.042 9.012 8.909 34.782 10.961 51.505.095.876-.1 1.6-1.164 1.632-4.047-.245-8.41.992-12.241-.225"
                ></path>
              </svg>
              <svg
                viewBox="0 0 86.571 77.869"
                width="86.571"
                height="77.869"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  fill="#fff"
                  d="M77.687 25.02c-.1 24.34-32.909 19.356-26.366-3.3 7.454-14.624 25.252-15.971 26.366 3.3m-23.735 1.554c-.167 5.736 4.267 13.734 10.842 12.061 4.217-.975 8.7-5.47 7.8-10.914-.591-4.459-1.712-14.748-7.949-13.361-4.8 2.149-11.086 6.265-10.691 12.215"
                ></path>
                <path
                  fill="#fff"
                  d="M40.4 28.347c-4.913-.13-9.395-1.282-11.592 1.5-3.662 4.644-4.025 17.871-3.873 24.211a54.427 54.427 0 0128.083 13.615 22.078 22.078 0 01-2.677 6.151 21.7 21.7 0 01-4.272 4.043 130.725 130.725 0 00-12.247-8.431c-12.278-7.265-27.8-5.981-33.344-4.6-.265-2.576-1.263-5.158.76-12.374 3.489.021 7.75-.376 11.3.189a120.1 120.1 0 01-1.7-18.8c-.761-15.815 16.647-25.492 34.378-20.637 0 0 1.147-1.728 2.842-4.023C55.74-.335 71.074-3.761 79.509 5.238 83.972 10 87.94 20.879 86.117 29.321c-1.665 7.713-2.919 11.511-8.865 17.993-5.363 5.844-9.88 6.56-15.121 6.458-11.057-.214-21.254-9.98-21.729-25.429m3.013-4.215c1.009 5.427.063 11.415 3.433 16.461 6.185 9.266 15.967 14.107 26.5 5.593 12.368-10 12.817-28.812 4.714-37.807-4.217-4.68-10.748-6.7-19.121-3.431-10.882 4.25-10.002 13.953-14.931 12.511-10.983-3.213-25.031-1.419-27.984 10.478-3.218 9.273-1.409 17.9.025 27.437-4.994.706-7.46.246-12.06-.176a10.407 10.407 0 00.029 6.49 57.7 57.7 0 0123.148 1.821c7.051 2.075 18.846 10.777 18.846 10.777 2.222-1.026 3.8-5.316 3.761-5.585-1.484-2.454-6.489-5.422-10.415-7.427a42.9 42.9 0 00-11-4.021c-1.337-.32-6.324-1.2-6.324-1.2-1.008-8.706-1.062-22.059 3.362-28.129 3.44-4.719 9.991-3.954 18.023-3.792"
                ></path>
              </svg>
              <svg
                viewBox="0 0 38.083 49.489"
                width="38.083"
                height="49.489"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  fill="#fff"
                  d="M10.816.213c2.267-.085 4.224-.266 6.173-.2a2.266 2.266 0 012.381 2.57c.011 6.74 3.244 11.408 9.14 14.44a27.947 27.947 0 015.088 3.072 12.453 12.453 0 014.481 10.367 32.147 32.147 0 01-1.544 10 8.124 8.124 0 01-3.356 4.245 29.356 29.356 0 01-12.379 4.4 22.049 22.049 0 01-6.125.255 11.123 11.123 0 01-3.916-1.328c-4.472-2.465-7.579-6.013-8.754-11.067-.746-3.211-2.148-6.29-1.991-9.687.036-.791.06-1.584.095-2.5 2.266-.062 4.381-.163 6.494-.136a1.515 1.515 0 011.078.849 6.939 6.939 0 01.462 2.369 29.908 29.908 0 002.364 10.71c1.425 3.633 4.2 5.635 8.178 5.465a15.589 15.589 0 008.162-2.343c3.01-1.976 4.064-4.928 4.7-8.158a11.033 11.033 0 00-5.175-12.129 38.459 38.459 0 00-4.76-2.773c-2.242-1.033-3.725-2.851-5.187-4.663a24.334 24.334 0 01-4.161-8.2c-.534-1.718-.915-3.485-1.448-5.559"
                ></path>
              </svg>
              <svg
                viewBox="0 0 45.966 71.998"
                width="45.966"
                height="71.998"
                xmlns="http://www.w3.org/2000/svg"
              >
                <path
                  fill="#fff"
                  d="M44.811 42.745a9.387 9.387 0 00-3.316-4.459c-5.273-3.632-7.107-7.9-16.9-8.772-8.915-.52-13.092 7.128-15.1 7.619.726-7.01 2.209-15.5 2.9-22.24 9.263 1.093 18.482 1.33 27.769 1.924 4.929.41 3.126-8.7 3.715-12-7.317-3.2-15.6-2.053-23.38-3.37-3.429.409-16.337-3.752-16.658.442-1.7 15.365-4.988 30.41-3.438 45.953.145 14.179 17.1 28.934 30.892 22.678 10.2-3.932 17.629-17.041 13.515-27.774M21.56 61.463c-2.454-.3-4.416-1.241-5.241-3.37-.778-3.421-4.042-7.723-1.883-10.986 4.1-4.381 11.783-11.046 17.19-4.695 7.488 7.713-.78 20.147-10.067 19.05"
                ></path>
              </svg>
            </div>
            <h2 className={styles.mobileTitle}>კოსმოსამდე</h2>
            <div className={styles.mobileIcons}>
              {Object.entries(bookData).map(([[], { img, title }]) => (
                <img key={title} src={img} alt={title} />
              ))}
            </div>
          </div>
        </div>
      </section>
      <section ref={sectionRef} className={styles.mobileContents}>
        <ChapterImages />
      </section>
      <section className={styles.MobilePdf}>
        <div className={styles.mobilePdfContent}>
          <h3>გადმოიწერე წიგნის PDF ვერსია</h3>
          <a
            href="https://fromchaostocosmos.sandroasatiani.com/SandroAsatiani_ChaosidanCosmosamde.pdf"
            target="_blank"
          >
            <img
              src="/assets/svgs/content-chapter-svg/PDFBookDownload.svg"
              alt="pdfBook"
            />
          </a>
        </div>
      </section>
      <section ref={prefaceRef} className={styles.MobilePreface}>
        <h2>წინასიტყვაობა</h2>
        <div className={styles.prefaceDescription}>
          <div>
            სანდრო ასათიანის წიგნი „ქაოსიდან კოსმოსამდე“ მცირე მოთხრობების, მე
            ვიტყოდი, იგავების ნაკრებია. თანამედროვე მანუსკრიპტი, სადაც ზოგან
            მინიშნებებით, ზოგან პირდაპირ მითითებულია ფრაზები, სურათ-ხატები და
            სიტყვები, რომლებიც სატრანზიტო პუნქტების დანიშნულებას ასრულებს{" "}
            <span>terra incognita</span>-ში, ციფრულ ტერიტორიებზე, სადაც ან ჯერ
            არავის დაუდგამს ფეხი, ან უკვე მანდაა და სჭირდება ფსიქოგეოგრაფიული,
            ინტერაქტიული გზამკვლევი, „მინიშნებები“, რათა იპოვოს „ჭეშმარიტი
            მასწავლებელი“ ან უსაფრთხო გზა კომპიუტერული თამაშის საბოლოო ტურისკენ,
            სადაც მისთვის უამრავ საიდუმლოს აეხდება ფარდა.
            <p>
              „ცხოვრება რაღაცით კომპიუტერულ თამაშს ჰგავს. თამაშის მთავარი გმირის
              მოულოდნელობებით სავსე თავგადასავალი იწყება. მას მუდამ არჩევანის
              გაკეთება უწევს. თითოეულ არჩევანს, თავის მხრივ, ახალი მოულოდნელობა
              მოსდევს. არავინ იცის, სად მიიყვანს მას თამაში, გასხივოსნებულ
              გამარჯვებამდე თუ მოულოდნელ დასასრულამდე.
            </p>
            <p>
              ციფრულ ტექნოლოგიებს, ისე, როგორც არასდროს, სჭირდება თავისი, ახალი
              მითოსი. მიუხედავად იმისა, რომ ტექნოლოგიები სინათლის სიჩქარით
              ვითარდება, ჩვენ, ადამიანები, ჯერ კიდევ ვცხოვრობთ უძველესი
              არაცნობიერი არქეტიპების რეალობაში, სანდრო ცდილობს, ეს არქეტიპები
              ციფრულ სამყაროში აღმოაჩინოს და, თუ შესაძლებელია, მათი ახალი,
              თანამედროვე ტექნოლოგიებს მისადაგებული ვერსია გამოიგონოს.
              <span>«hevel havalim»</span> — გაკვრით ამბობს ამ ფრაზას კრეატიული
              რეკლამის შემქმნელი და ჩვენ გვესმის ექო ათასეული წლების წინ
              დაწერილი ტექსტისა. სინამდვილეში, კაცობრიობის არაცნობიერში
              ჩაკოდირებული არქეტიპები დღემდე ფუნქციონირებს ჩვენს სიღრმეებში,
              მთავარი ისაა, როგორ შევძლებთ მათ გამოყენებასა და მანიფესტაციას
              ახალ, ციფრულ სამყაროში.
            </p>
            <p>
              თავად სათაური „ქაოსიდან კოსმოსამდე“ მიგვანიშნებს კიდევ უფრო
              საინტერესო რამეზე: ძველ მითოსებში პირვანდელი ქაოსიდან (რომელიც
              თავის თავში პოტენციურ კოსმოსებს უკვე შეიცავს) – კოსმოსს (წესრიგს),
              როგორც წესი, კულტურული გმირები ან დემიურგები ქმნიან.
            </p>
            <p>
              ისინი, ვინც დღეს კოდს სწავლობს, ციფრულ სამყაროებს, ჩეთბოტებს,
              აპლიკაციებსა და პროგრამებს ქმნიან – სწორედ რომ ახალგაზრდა
              დემიურგები არიან, პატარა ღმერთები, რომლებიც ქაოსს აწესრიგებენ,
              რათა მისგან კოსმოსი, ახალი წესრიგი შექმნან.
            </p>
            <p>
              ამგვარად, ეს წიგნი ამ ახალგაზრდა დემიურგებისთვისაა განკუთვნილი.
            </p>
            <p>
              ალქიმიკოსებისა თუ ჯადოქრების ყველა ძველი აუხდენელი ოცნება, დღეს ამ
              დემიურგების კლავიატურებზე იქმნება, შელოცვები კოდებმა შეცვალა,
              ეზოტერიკული კაბალისტური გამოთვლები – კომპიუტერების მათემატიკური
              გამოთვლების სიმძლავრემ, ანგელოზების (რაც ბერძნულად ნიშნავს
              „მაცნეს, მესენჯერს) გამოცხადებები – ჩეთბოტებმა და ვირტუალურმა
              რეალობამ, ინიციაციის პრაქტიკები – სახელმწიფო „ლევიათანთან“
              შეხვედრამ, მედიტაციები – კომპიუტერულმა თამაშებმა, ღვთაებები –
              ხელოვნური ინტელექტის ვირტუალურმა არსებებმა, ტაძრები – სერვერებმა.
            </p>
            <p>
              „ახალგაზრდა ჯადოქრის თვალწინ, კომპიუტერის ეკრანზე მის მიერ
              შექმნილი სამყარო იყო გამოსახული“, წერს სანდრო და ოსტატურად
              ჟონგლიორობს უძველესი არქეტიპებითა და ულტრათანამედროვე
              ტექნოლოგიებით.
            </p>
            <p>
              წიგნის მთავარი ხიბლი სწორედ ამ უძველესი არქეტიპებისა და
              ტექნოლოგიური სინგულარობისკენ მიმავალი კაცობრიობის ერთმანეთთან
              შეზავებაა, ტექსტი ყოველ წინადადებაში იტოტება რამდენიმე სატრანზიტო
              პუნქტად, სადაც სხვადასხვა საგანძურია შემონახული. თანამედროვე
              დემიურგის თუ კულტურული გმირის მისიაა, არსებული ქაოსიდან ის კოსმოსი
              შექმნას, სადაც ყველანი სრულიად ახალ, შეუცნობელ, საიდუმლოებებითა და
              გამოცხადებებით სავსე რეალობაში მოვხვდებით. ისტორიის არცერთ ეტაპზე
              ჩვენ არ გვქონია მსგავსი ილუმინაციური, ღვთაებრივი შესაძლებლობები.
            </p>
            <p>
              ახალგაზრდა დემიურგო, ნუ შეუშინდები მახეებსა და ხაფანგებს, რომელსაც
              სოციალური თუ კულტურული პროგრამირება გიდებს წინ, გაშიფრე ეს
              მანუსკრიპტი და გაბედე შექმნა რაღაც რევოლუციური, რაღაც დიდი, რაღაც
              მაგიური, რაც შეცვლის „რეალობას“, ისეთს, როგორსაც მას ვიცნობთ,
              ვინაიდან მოვიდა დრო, თავს მოხვეული რეალობა რადიკალურად შეიცვალოს
              და ჩვენ შევაბიჯოთ ტექნოლოგიური მაგიის სამყაროში. ყველაფერი შენს
              ხელთაა, კლავიატურაა შენს ხელთ.
            </p>
            <p>
              სანდრო ასათიანის ეს წიგნი კი გზამკვლევია ამ საოცარ მოგზაურობაში.
            </p>
            <p className={styles.prefaceAuthor}>ზურა ჯიშკარიანი</p>
          </div>
        </div>
      </section>
      <section ref={playerRef} className={styles.MobilePlayer}>
        <div className={styles.mobileSoundContent}>
          <div className={styles.titleBurgerWrapper}>
            <h2 className={styles.playerTitle}>{bookData[book].title}</h2>
            <button onClick={scrollToSection}>
              <div className={styles.playerBurger}>
                <svg
                  viewBox="0 0 60.764 60.719"
                  xmlns="http://www.w3.org/2000/svg"
                  width="60.764"
                  height="60.719"
                >
                  <path
                    className="path-fill"
                    fill="#ffffff"
                    d="M17.216 25.455a197.715 197.715 0 0028.263-.623c2.367-.222 2.391-3.95 0-3.726a197.715 197.715 0 01-28.263.623c-2.4-.118-2.391 3.608 0 3.726m.98 8.722a173.412 173.412 0 0026.31-.484c2.367-.222 2.39-3.952 0-3.726a173.412 173.412 0 01-26.31.484c-2.4-.138-2.387 3.589 0 3.726m.101 9.976c9.185-.122 18.37-.281 27.554-.4 2.395-.032 2.4-3.758 0-3.726-9.185.12-18.37.279-27.554.4-2.4.032-2.4 3.758 0 3.726"
                  ></path>
                </svg>
              </div>
            </button>
          </div>
          <div className={styles.soundButtons} ref={soundButtonsRef}>
            <img
              onClick={handlePlayToggle}
              src={`/assets/svgs/generic/${isPaused ? "play" : "pause"}.svg`}
              alt="toggle playback"
              className={styles.togglePlaybackImage}
            />
          </div>
          <div className={styles.playerBottomBar}>
            <Loader
              mobile
              trackProgress
              width={`${width * 100}%`}
              initialWidth={initialWidth}
              isSeeking={isSeeking}
              transition={{ duration: 0 }}
              handleTransition={{ duration: 0.2, delay: 0.8 }}
              onDragStart={handleDragStart}
              onDragStop={handleDragStop}
              onDrag={handleDrag}
            />

            <div className={styles.timerContent}>
              <span className={styles.timeLeft}>
                {getTimeLeft(duration, isSeeking ? seekTime : currentTime)}
              </span>
            </div>
          </div>
        </div>
      </section>
      <section className={styles.first}></section>
      <section id="aboutProject" className={styles.MobileAboutProject}>
        <h2>პროექტის შესახებ</h2>
        <div>
          <p>
            როცა წიგნი გვახსენდება, ქაღალდის ფურცელზე დაბეჭდილი ობიექტი
            წარმოგვიდგება, მაგარ ან რბილ ყდაში აკინძული. ეს ჩვენი წარმოდგენა
            დღეს შეიძლება საერთოდ აღარ შეესაბამებოდეს რეალობას. დღეს წიგნს
            ხშირად ფაილის სახე აქვს. ასეთ წიგნს საერთოდ არ გააჩნია მატერიალური
            გარსი. ის მხოლოდ კომპიუტერულ მოწყობილობაში ჩაწერილი ბინარული
            მონაცემების სახით არსებობს. მისი ფორმა იმ მოწყობილობით არის
            განპირობებული, რომელშიც თავად წიგნია ჩატვირთული. კაცობრიობის
            განვითარების სხვადასხვა პერიოდში წიგნს განსხვავებული სახით
            გამოსცემდნენ. უძველესი შუმერული წიგნები თიხის ფირფიტებისა იყო. ჩვენი
            გადმოსახედიდან, ისინი აგურებს უფრო ჰგვანან ვიდრე წიგნებს.
            ეგვიპტელები წიგნებს პაპირუსზე წერდნენ, მასალიდან გამომდინარე, ასეთ
            წიგნებს გრძელი გრაგნილების სახე ჰქონდათ. შუასაუკუნეების ხელნაწერი
            წიგნები, ფოლიანტები, ძალიან დიდი ზომისა იყო. ასეთ წიგნთან ერთად შენს
            ოთახში ვერ განმარტოვდებოდი, ასეთ წიგნს მუხლებზე ვერ დაიდებდი, მათ
            სპეციალურად მოწყობილ მაგიდებზე დებდნენ და ისე კითხულობდნენ. წიგნის
            გარეგანი ფორმის ცვლილებასთან ერთად იცვლებოდა წიგნის ავტორი, მისი
            გამომცემელი და წიგნის მკითხველი. იცვლებოდა თავად ამბავიც რომელსაც
            წიგნი ყვება. არ იცვლება ის უსაზღვრო შესაძლებლობები რომელსაც წიგნი
            გვაძლევს. ვიმოგზაუროთ იქ სადაც არ ვყოფილვართ, გავხდეთ თანაზიარი იმ
            ამბებისა რომელიც ჩვენ არ გადაგვხდენია თავს. გავიზიაროთ აზრები
            რომელსაც ავტორი გვთავაზობს. ეს წიგნი, წიგნის ინტერნეტ გამოცემაა. ამ
            წიგნით მოყოლილი ამბები ტექნოლოგიებსა და თანამედროვე ადამიანის მაგიურ
            შესაძლებლობებზეა. ამ წიგნის ქაღალდზე დაბეჭდილი ვერსია არ არსებობს,
            წიგნში მოთხრობილი ამბების წაკითხვა, მოსმენა მხოლოდ ტექნოლოგიების
            წყალობით არის შესაძლებელი. წიგნის ვებ გამოცემაზე მუშაობდნენ:
          </p>
          <p>რედაქტორი: ანა ჭაბაშვილი</p>
          <p>პროგრამისტების ჯგუფი:</p>
          <p>ირაკლი მჭედლიშვილი,</p>
          <p>ლუკა ბლიაძე,</p>
          <p> გრიგორი ხუნდაძე,</p>
          <p>გიგა ამირიძე,</p>
          <p>ქეთევან ჭაბუკიანი,</p>
          <p>მერი გოგოჩაშვილი,</p>
          <p>გიორგი სანოძე,</p>
          <p>ნიკა ქვრივიშვილი,</p>
          <p>მინდია არაბული.</p>
        </div>
      </section>
    </div>
  );
};
