import React from "react";
import { useNavigate } from "react-router-dom";
import { Loader } from "../../components/Loader/Loader";
import { Navigation } from "../../components/Navigation";
import { ActionBar } from "../../components/ActionBar";
import styles from "./Preface.module.scss";

export const Preface = () => {
  const navigate = useNavigate();

  const handlePrevClick = () => {
    navigate("/");
  };

  const handleNextClick = () => {
    navigate("/books/qaosidan-kosmosamde");
  };
  return (
    <div className={styles.prefacePage}>
      <Loader
        width={["100%", "15%"]}
        transition={{ duration: 1, ease: "easeOut" }}
      />
      <Navigation />
      <ActionBar
        onPrevClick={handlePrevClick}
        onNextClick={handleNextClick}
        preface={true}
      />

      <div className={styles.prefaceMainPart}>
        <h4>წინასიტყვაობა</h4>
        <div className={styles.prefaceContent}>
          <div className={styles.prefaceText}>
            <p>
              სანდრო ასათიანის წიგნი „ქაოსიდან კოსმოსამდე“ მცირე მოთხრობების, მე
              ვიტყოდი, იგავების ნაკრებია. თანამედროვე მანუსკრიპტი, სადაც ზოგან
              მინიშნებებით, ზოგან პირდაპირ მითითებულია ფრაზები, სურათ-ხატები და
              სიტყვები, რომლებიც სატრანზიტო პუნქტების დანიშნულებას ასრულებს
              terra incognita-ში, ციფრულ ტერიტორიებზე, სადაც ან ჯერ არავის
              დაუდგამს ფეხი, ან უკვე მანდაა და სჭირდება ფსიქოგეოგრაფიული,
              ინტერაქტიული გზამკვლევი, „მინიშნებები“, რათა იპოვოს „ჭეშმარიტი
              მასწავლებელი“ ან უსაფრთხო გზა კომპიუტერული თამაშის საბოლოო
              ტურისკენ, სადაც მისთვის უამრავ საიდუმლოს აეხდება ფარდა.
            </p>
            <p>
              „ცხოვრება რაღაცით კომპიუტერულ თამაშს ჰგავს. თამაშის მთავარი გმირის
              მოულოდნელობებით სავსე თავგადასავალი იწყება. მას მუდამ არჩევანის
              გაკეთება უწევს. თითოეულ არჩევანს, თავის მხრივ, ახალი მოულოდნელობა
              მოსდევს. არავინ იცის, სად მიიყვანს მას თამაში, გასხივოსნებულ
              გამარჯვებამდე თუ მოულოდნელ დასასრულამდე.
            </p>
            <p>
              ციფრულ ტექნოლოგიებს, ისე, როგორც არასდროს, სჭირდება თავისი, ახალი
              მითოსი. მიუხედავად იმისა, რომ ტექნოლოგიები სინათლის სიჩქარით
              ვითარდება, ჩვენ, ადამიანები, ჯერ კიდევ ვცხოვრობთ უძველესი
              არაცნობიერი არქეტიპების რეალობაში, სანდრო ცდილობს, ეს არქეტიპები
              ციფრულ სამყაროში აღმოაჩინოს და, თუ შესაძლებელია, მათი ახალი,
              თანამედროვე ტექნოლოგიებს მისადაგებული ვერსია გამოიგონოს. «hevel
              havalim» — გაკვრით ამბობს ამ ფრაზას კრეატიული რეკლამის შემქმნელი
              და ჩვენ გვესმის ექო ათასეული წლების წინ დაწერილი ტექსტისა.
              სინამდვილეში, კაცობრიობის არაცნობიერში ჩაკოდირებული არქეტიპები
              დღემდე ფუნქციონირებს ჩვენს სიღრმეებში, მთავარი ისაა, როგორ
              შევძლებთ მათ გამოყენებასა და მანიფესტაციას ახალ, ციფრულ სამყაროში.
            </p>
            <p>
              თავად სათაური „ქაოსიდან კოსმოსამდე“ მიგვანიშნებს კიდევ უფრო
              საინტერესო რამეზე: ძველ მითოსებში პირვანდელი ქაოსიდან (რომელიც
              თავის თავში პოტენციურ კოსმოსებს უკვე შეიცავს) – კოსმოსს (წესრიგს),
              როგორც წესი, კულტურული გმირები ან დემიურგები ქმნიან.
            </p>
            <p>
              ისინი, ვინც დღეს კოდს სწავლობს, ციფრულ სამყაროებს, ჩეთბოტებს,
              აპლიკაციებსა და პროგრამებს ქმნიან – სწორედ რომ ახალგაზრდა
              დემიურგები არიან, პატარა ღმერთები, რომლებიც ქაოსს აწესრიგებენ,
              რათა მისგან კოსმოსი, ახალი წესრიგი შექმნან.
            </p>
            <p>
              ამგვარად, ეს წიგნი ამ ახალგაზრდა დემიურგებისთვისაა განკუთვნილი.
            </p>
            <p>
              ალქიმიკოსებისა თუ ჯადოქრების ყველა ძველი აუხდენელი ოცნება, დღეს ამ
              დემიურგების კლავიატურებზე იქმნება, შელოცვები კოდებმა შეცვალა,
              ეზოტერიკული კაბალისტური გამოთვლები – კომპიუტერების მათემატიკური
              გამოთვლების სიმძლავრემ, ანგელოზების (რაც ბერძნულად ნიშნავს
              „მაცნეს, მესენჯერს) გამოცხადებები – ჩეთბოტებმა და ვირტუალურმა
              რეალობამ, ინიციაციის პრაქტიკები – სახელმწიფო „ლევიათანთან“
              შეხვედრამ, მედიტაციები – კომპიუტერულმა თამაშებმა, ღვთაებები –
              ხელოვნური ინტელექტის ვირტუალურმა არსებებმა, ტაძრები – სერვერებმა.
            </p>
            <p>
              „ახალგაზრდა ჯადოქრის თვალწინ, კომპიუტერის ეკრანზე მის მიერ
              შექმნილი სამყარო იყო გამოსახული“, წერს სანდრო და ოსტატურად
              ჟონგლიორობს უძველესი არქეტიპებითა და ულტრათანამედროვე
              ტექნოლოგიებით.
            </p>
            <p>
              წიგნის მთავარი ხიბლი სწორედ ამ უძველესი არქეტიპებისა და
              ტექნოლოგიური სინგულარობისკენ მიმავალი კაცობრიობის ერთმანეთთან
              შეზავებაა, ტექსტი ყოველ წინადადებაში იტოტება რამდენიმე სატრანზიტო
              პუნქტად, სადაც სხვადასხვა საგანძურია შემონახული. თანამედროვე
              დემიურგის თუ კულტურული გმირის მისიაა, არსებული ქაოსიდან ის კოსმოსი
              შექმნას, სადაც ყველანი სრულიად ახალ, შეუცნობელ, საიდუმლოებებითა და
              გამოცხადებებით სავსე რეალობაში მოვხვდებით. ისტორიის არცერთ ეტაპზე
              ჩვენ არ გვქონია მსგავსი ილუმინაციური, ღვთაებრივი შესაძლებლობები.
            </p>
            <p>
              ახალგაზრდა დემიურგო, ნუ შეუშინდები მახეებსა და ხაფანგებს, რომელსაც
              სოციალური თუ კულტურული პროგრამირება გიდებს წინ, გაშიფრე ეს
              მანუსკრიპტი და გაბედე შექმნა რაღაც რევოლუციური, რაღაც დიდი, რაღაც
              მაგიური, რაც შეცვლის „რეალობას“, ისეთს, როგორსაც მას ვიცნობთ,
              ვინაიდან მოვიდა დრო, თავს მოხვეული რეალობა რადიკალურად შეიცვალოს
              და ჩვენ შევაბიჯოთ ტექნოლოგიური მაგიის სამყაროში. ყველაფერი შენს
              ხელთაა, კლავიატურაა შენს ხელთ.
            </p>
            <p>
              სანდრო ასათიანის ეს წიგნი კი გზამკვლევია ამ საოცარ მოგზაურობაში.
            </p>
          </div>
          <h5>ზურა ჯიშკარიანი</h5>
        </div>
      </div>
    </div>
  );
};

//
